docs/benchmarks/tier-5-cells/k6-noisy-cell-a-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /tmp/k6_cell_a.js
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 52s max duration (incl. graceful stop):
              * default: 40 looping VUs for 22s (gracefulStop: 30s)


running (01.0s), 40/40 VUs, 6966 complete and 0 interrupted iterations
default   [   5% ] 40 VUs  01.0s/22s

running (02.0s), 40/40 VUs, 15685 complete and 0 interrupted iterations
default   [   9% ] 40 VUs  02.0s/22s

running (03.0s), 40/40 VUs, 23712 complete and 0 interrupted iterations
default   [  14% ] 40 VUs  03.0s/22s

running (04.0s), 40/40 VUs, 29545 complete and 0 interrupted iterations
default   [  18% ] 40 VUs  04.0s/22s

running (05.0s), 40/40 VUs, 35194 complete and 0 interrupted iterations
default   [  23% ] 40 VUs  05.0s/22s

running (06.0s), 40/40 VUs, 41163 complete and 0 interrupted iterations
default   [  27% ] 40 VUs  06.0s/22s

running (07.0s), 40/40 VUs, 44069 complete and 0 interrupted iterations
default   [  32% ] 40 VUs  07.0s/22s

running (08.0s), 40/40 VUs, 45958 complete and 0 interrupted iterations
default   [  36% ] 40 VUs  08.0s/22s

running (09.0s), 40/40 VUs, 48228 complete and 0 interrupted iterations
default   [  41% ] 40 VUs  09.0s/22s

running (10.0s), 40/40 VUs, 50473 complete and 0 interrupted iterations
default   [  45% ] 40 VUs  10.0s/22s

running (11.0s), 40/40 VUs, 52786 complete and 0 interrupted iterations
default   [  50% ] 40 VUs  11.0s/22s

running (12.0s), 40/40 VUs, 55105 complete and 0 interrupted iterations
default   [  55% ] 40 VUs  12.0s/22s

running (13.0s), 40/40 VUs, 57344 complete and 0 interrupted iterations
default   [  59% ] 40 VUs  13.0s/22s

running (15.3s), 40/40 VUs, 59575 complete and 0 interrupted iterations
default   [  64% ] 40 VUs  14.0s/22s

running (16.3s), 40/40 VUs, 61791 complete and 0 interrupted iterations
default   [  68% ] 40 VUs  15.0s/22s

running (17.3s), 40/40 VUs, 64059 complete and 0 interrupted iterations
default   [  73% ] 40 VUs  16.0s/22s

running (18.3s), 40/40 VUs, 66256 complete and 0 interrupted iterations
default   [  77% ] 40 VUs  17.0s/22s

running (19.3s), 40/40 VUs, 68509 complete and 0 interrupted iterations
default   [  82% ] 40 VUs  18.0s/22s

running (20.3s), 40/40 VUs, 70750 complete and 0 interrupted iterations
default   [  86% ] 40 VUs  19.0s/22s

running (21.3s), 40/40 VUs, 73059 complete and 0 interrupted iterations
default   [  91% ] 40 VUs  20.0s/22s

running (22.3s), 40/40 VUs, 75285 complete and 0 interrupted iterations
default   [  95% ] 40 VUs  21.0s/22s

running (23.3s), 40/40 VUs, 77522 complete and 0 interrupted iterations
default   [ 100% ] 40 VUs  22.0s/22s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=11.97ms min=1.54ms med=8.58ms max=1.37s    p(90)=22.1ms  p(95)=26.01ms
      { expected_response:true }...: avg=9.54ms  min=1.54ms med=5.78ms max=1.37s    p(90)=22.67ms p(95)=27.33ms
    http_req_failed................: 31.68% 24581 out of 77568
    http_reqs......................: 77568  3320.849255/s

    EXECUTION
    iteration_duration.............: avg=11.33ms min=1.59ms med=8.64ms max=155.67ms p(90)=22.15ms p(95)=26.04ms
    iterations.....................: 77568  3320.849255/s
    vus............................: 40     min=40             max=40
    vus_max........................: 40     min=40             max=40

    NETWORK
    data_received..................: 14 MB  608 kB/s
    data_sent......................: 15 MB  638 kB/s



running (23.4s), 00/40 VUs, 77568 complete and 0 interrupted iterations
default ✓ [ 100% ] 40 VUs  22s